["A yeast infection is a fungal infection caused by an overgrowth of yeast. It most commonly affects the vagina in women, causing itching, burning, redness, and a thick white discharge. Yeast infections can also affect other areas of the body, including the mouth (thrush), skin folds, and nail beds. They are usually treated with antifungal medications.", "Asthma is a chronic condition affecting the airways in the lungs. During an asthma attack, the airways become inflamed and narrow, making it difficult to breathe. Symptoms include wheezing, coughing, chest tightness, and shortness of breath. Asthma can be managed with proper medication and by avoiding triggers.", "Hypertension, or high blood pressure, is a condition where the force of blood against the artery walls is consistently too high. It often has no symptoms but can lead to serious health problems like heart disease and stroke if left untreated. Regular monitoring and lifestyle changes are essential for management.", "Sinusitis is an inflammation of the sinuses, often caused by viral, bacterial, or fungal infections. Symptoms include facial pain, pressure, nasal congestion, thick nasal discharge, and reduced sense of smell. Treatment depends on the cause but may include antibiotics for bacterial infections.", "Arthritis refers to inflammation of one or more joints, causing pain, stiffness, and reduced mobility. Osteoarthritis results from wear and tear of joint cartilage, while rheumatoid arthritis is an autoimmune disorder. Treatment focuses on pain relief, maintaining function, and preventing further joint damage.", "Eczema, also known as atopic dermatitis, is a chronic skin condition characterized by itchy, inflamed skin. It often appears as dry, thickened, scaly patches on the face, hands, elbows, and knees. Triggers may include allergens, irritants, stress, and climate factors. Treatment includes moisturizers and topical medications.", "Migraine is a neurological condition characterized by severe, recurring headaches often accompanied by nausea, vomiting, and sensitivity to light and sound. Some people experience an aura before the headache. Triggers may include stress, certain foods, hormonal changes, and environmental factors.", "Gastroesophageal reflux disease (GERD) occurs when stomach acid frequently flows back into the esophagus. Symptoms include heartburn, chest pain, difficulty swallowing, and regurgitation of food or sour liquid. Lifestyle changes and medications can help manage GERD.", "Anemia is a condition where you don't have enough healthy red blood cells to carry adequate oxygen to your tissues. Symptoms include fatigue, weakness, pale skin, shortness of breath, and dizziness. Causes include iron deficiency, vitamin deficiencies, chronic diseases, and genetic disorders.", "Pneumonia is an infection that inflames the air sacs in one or both lungs, which may fill with fluid. Symptoms include cough with phlegm, fever, chills, and difficulty breathing. It can be caused by bacteria, viruses, or fungi and may range from mild to life-threatening.", "Depression is a mood disorder that causes a persistent feeling of sadness and loss of interest. It affects how you feel, think, and behave and can lead to various emotional and physical problems. Symptoms include persistent sadness, lack of energy, changes in appetite or sleep, and thoughts of death or suicide.", "Influenza (flu) is a contagious respiratory illness caused by influenza viruses. Symptoms include fever, cough, sore throat, body aches, fatigue, and sometimes vomiting and diarrhea. Complications can be serious, especially in high-risk groups like young children and older adults.", "Allergic rhinitis, or hay fever, is an allergic response causing cold-like symptoms. Triggers include pollen, dust mites, pet dander, and mold. Symptoms include runny nose, sneezing, nasal congestion, and itchy eyes. Treatment options include antihistamines, nasal corticosteroids, and allergen avoidance.", "Urinary tract infections (UTIs) are infections affecting any part of the urinary system. They most commonly occur in the bladder and urethra. Symptoms include a strong urge to urinate, burning sensation during urination, cloudy urine, and pelvic pain. Most UTIs are treated with antibiotics.", "Conjunctivitis, or pink eye, is inflammation of the conjunctiva, the clear tissue covering the white of the eye. It can be caused by viruses, bacteria, allergies, or irritants. Symptoms include redness, itching, grittiness, and discharge. Treatment depends on the cause but may include eye drops or ointments.", "Chickenpox is a highly contagious viral infection caused by the varicella-zoster virus. It's characterized by an itchy rash with blisters that usually starts on the face, chest, and back before spreading. Other symptoms include fever, fatigue, and headache. A vaccine is available for prevention.", "Bronchitis is inflammation of the bronchial tubes that carry air to and from the lungs. Acute bronchitis is usually caused by viruses and resolves within a few weeks. Chronic bronchitis is a more serious condition often caused by smoking. Symptoms include cough, mucus production, fatigue, and shortness of breath.", "Thyroid disorders affect the thyroid gland, which produces hormones that regulate metabolism. Hyperthyroidism occurs when the thyroid produces too much hormone, causing symptoms like weight loss, rapid heartbeat, and anxiety. Hypothyroidism occurs when it produces too little, causing symptoms like weight gain, fatigue, and cold intolerance.", "Osteoporosis is a condition where bones become weak and brittle, increasing the risk of fractures. It often develops without symptoms until a fracture occurs. Risk factors include aging, being female, low body weight, low calcium intake, and certain medications. Treatment includes medication, calcium, vitamin D, and weight-bearing exercise.", "Psoriasis is a chronic skin condition that speeds up the life cycle of skin cells, causing them to build up rapidly on the surface of the skin. The extra skin cells form scales and red patches that are often itchy and sometimes painful. It's thought to be an immune system problem and can be triggered by infections, stress, and cold weather."]